{"backend": "tensorflow", "keras_version": "2.0.3", "config": [{"config": {"data_format": "channels_last", "dtype": "float32", "trainable": true, "cropping": [[60, 20], [0, 0]], "batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1"}, "class_name": "Cropping2D"}, {"config": {"output_shape_type": "raw", "output_shape": null, "trainable": true, "arguments": {}, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000sT\u0000\u0000\u0000d\u0001\u0000d\u0002\u0000\u0084\u0000\u0000}\u0001\u0000d\u0003\u0000d\u0004\u0000\u0084\u0000\u0000}\u0002\u0000d\u0005\u0000d\u0006\u0000\u0084\u0000\u0000}\u0003\u0000|\u0000\u0000d\u0007\u0000\u001b}\u0000\u0000|\u0001\u0000|\u0000\u0000\u0083\u0001\u0000}\u0000\u0000|\u0000\u0000d\b\u0000\u0018}\u0000\u0000|\u0003\u0000|\u0000\u0000\u0083\u0001\u0000}\u0000\u0000|\u0000\u0000S)\tNc\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0013\u0000\u0000\u0000s@\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000\u0089\u0000\u0000\u0088\u0000\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000\u0083\u0001\u0000}\u0001\u0000\u0088\u0000\u0000j\u0003\u0000d\u0002\u0000\u0087\u0000\u0000f\u0001\u0000d\u0003\u0000d\u0004\u0000\u0086\u0000\u0000d\u0005\u0000|\u0001\u0000\u0083\u0000\u0002S)\u0006N\u00e9\u0000\u0000\u0000\u0000\u00da\u0002fnc\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000\u0013\u0000\u0000\u0000s%\u0000\u0000\u0000\u0088\u0000\u0000j\u0000\u0000|\u0000\u0000d\u0001\u0000d\u0001\u0000d\u0002\u0000g\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0002\u0000g\u0003\u0000\u0083\u0003\u0000S)\u0005Nr\u0001\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00e9\u00ff\u00ff\u00ff\u00ffr\u0004\u0000\u0000\u0000)\u0001\u00da\u0005slice)\u0001\u00da\u0001i)\u0001\u00da\u0002tf\u00a9\u0000\u00fa\btrain.py\u00da\b<lambda>\u0012\u0000\u0000\u0000s\u0000\u0000\u0000\u0000z7preprocessing.<locals>.get_saturation.<locals>.<lambda>\u00da\u0005elems)\u0004\u00da\ntensorflow\u00da\u0005image\u00da\nrgb_to_hsv\u00da\u0006map_fn)\u0002\u00da\u0001x\u00da\u0003hsvr\b\u0000\u0000\u0000)\u0001r\u0007\u0000\u0000\u0000r\t\u0000\u0000\u0000\u00da\u000eget_saturation\u000f\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001\f\u0001\u0012\u0001z%preprocessing.<locals>.get_saturationc\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?r\b\u0000\u0000\u0000)\u0001r\u0010\u0000\u0000\u0000r\b\u0000\u0000\u0000r\b\u0000\u0000\u0000r\t\u0000\u0000\u0000\u00da\tnormalize\u0014\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001z preprocessing.<locals>.normalizec\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s%\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0002\u0000d\u0003\u0000g\u0002\u0000\u0083\u0002\u0000S)\u0004Nr\u0001\u0000\u0000\u0000\u00e9 \u0000\u0000\u0000\u00e9@\u0000\u0000\u0000)\u0003r\f\u0000\u0000\u0000r\r\u0000\u0000\u0000\u00da\rresize_images)\u0002r\u0010\u0000\u0000\u0000r\u0007\u0000\u0000\u0000r\b\u0000\u0000\u0000r\b\u0000\u0000\u0000r\t\u0000\u0000\u0000\u00da\u0006resize\u0017\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001z\u001dpreprocessing.<locals>.resize\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?r\b\u0000\u0000\u0000)\u0004r\u0010\u0000\u0000\u0000r\u0012\u0000\u0000\u0000r\u0015\u0000\u0000\u0000r\u0019\u0000\u0000\u0000r\b\u0000\u0000\u0000r\b\u0000\u0000\u0000r\t\u0000\u0000\u0000\u00da\rpreprocessing\u000e\u0000\u0000\u0000s\u0010\u0000\u0000\u0000\u0000\u0001\f\u0005\f\u0003\f\u0004\n\u0001\f\u0001\n\u0001\f\u0001", null, null], "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"use_bias": true, "padding": "valid", "trainable": true, "bias_regularizer": null, "kernel_size": [2, 2], "activation": "relu", "kernel_regularizer": null, "filters": 16, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [4, 4], "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "padding": "valid", "trainable": true, "bias_regularizer": null, "kernel_size": [2, 2], "activation": "relu", "kernel_regularizer": null, "filters": 32, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [4, 4], "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "linear", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential"}